---
kind: method
id: M:Autodesk.Revit.DB.Electrical.GroundConductorSizeSetIterator.#ctor
source: html/c97e21cf-e50a-6c52-f810-6860d9ecd3fb.htm
---
# Autodesk.Revit.DB.Electrical.GroundConductorSizeSetIterator.#ctor Method

For Internal Use Only.

## Syntax (C#)
```csharp
public GroundConductorSizeSetIterator()
```

## Remarks
This constructor is exposed to enable support for COM interop only. This object should never be created by the developer.